import styles from './PublicOffer.module.css';
import Paper from '@mui/material/Paper';

export const PublicOffer = () => (
	<div className={styles.container} data-testid='public-offer'>
		<Paper className={styles.paper}>
			<h1 className={styles.heading}>ПУБЛИЧНАЯ ОФЕРТА</h1>
			<h2 className={styles.heading}>о заключении договора купли-продажи</h2>
			<h3>1. Общие положения</h3>
			<p>
				В настоящей Публичной оферте содержатся условия заключения Договора
				купли-продажи (далее по тексту - «Договор купли-продажи» и/или
				«Договор»). Настоящей офертой признается предложение, адресованное
				одному или нескольким конкретным лицам, которое достаточно определенно и
				выражает намерение лица, сделавшего предложение, считать себя
				заключившим Договор с адресатом, которым будет принято предложение.
			</p>
			<p>
				Совершение указанных в настоящей Оферте действий является подтверждением
				согласия обеих Сторон заключить Договор купли-продажи на условиях, в
				порядке и объеме, изложенных в настоящей Оферте.
			</p>
			<p>
				Нижеизложенный текст Публичной оферты является официальным публичным
				предложением Продавца, адресованный заинтересованному кругу лиц
				заключить Договор купли-продажи в соответствии с положениями пункта 2
				статьи 437 Гражданского кодекса РФ.
			</p>
			<p>
				Договор купли-продажи считается заключенным и приобретает силу с момента
				совершения Сторонами действий, предусмотренных в настоящей Оферте, и,
				означающих безоговорочное, а также полное принятие всех условий
				настоящей Оферты без каких-либо изъятий или ограничений на условиях
				присоединения.
			</p>
			<p>Термины и определения:</p>
			<p>
				Договор – текст настоящей Оферты с Приложениями, являющимися
				неотъемлемой частью настоящей Оферты, акцептованный Покупателем путем
				совершения конклюдентных действий, предусмотренных настоящей Офертой.
			</p>
			<p>
				Конклюдентные действия — это поведение, которое выражает согласие с
				предложением контрагента заключить, изменить или расторгнуть договор.
				Действия состоят в полном или частичном выполнении условий, которые
				предложил контрагент.{' '}
			</p>
			<p>
				Сайт Продавца в сети «Интернет» – совокупность программ для электронных
				вычислительных машин и иной информации, содержащейся в информационной
				системе, доступ к которой обеспечивается посредством сети «Интернет» по
				доменному имени и сетевому адресу: https://onegia.ru
			</p>
			<p>Стороны Договора (Стороны) – Продавец и Покупатель.</p>
			<p>
				Товар - товаром по договору купли-продажи могут быть любые вещи с
				соблюдением правил, предусмотренных статьей 129 Гражданского кодекса РФ.
			</p>
			<h3>2. Предмет Договора</h3>
			<p>
				2.1. По настоящему Договору Продавец обязуется передать вещь (Товар) в
				собственность Покупателя, а Покупатель обязуется принять Товар и
				уплатить за него определенную денежную сумму.
			</p>
			<p>
				2.2. Наименование, количество, а также ассортимент Товара, его
				стоимость, порядок доставки и иные условия определяются на основании
				сведений Продавца при оформлении заявки Покупателем, либо
				устанавливаются на сайте Продавца в сети «Интернет» https://onegia.ru
			</p>
			<p>
				2.3. Акцепт настоящей Оферты выражается в совершении конклюдентных
				действий, в частности:
			</p>
			<ul>
				<li>
					путем составления и заполнения заявки на оформление заказа Товара;
				</li>
				<li>
					путем сообщения требуемых для заключения Договора сведений по
					телефону, электронной почте, указанными на сайте Продавца в сети
					«Интернет», в том числе, при обратном звонке Продавца по заявке
					Покупателя;
				</li>
				<li>оплаты Товара Покупателем.</li>
			</ul>
			<p>
				Данный перечень не является исчерпывающим, могут быть и другие действия,
				которые ясно выражают намерение лица принять предложение контрагента.{' '}
			</p>
			<h3>3. Права и обязанности Сторон</h3>
			<h4>Права и обязанности Продавца:</h4>
			<p>
				3.1.1. Продавец вправе требовать оплаты Товаров и их доставки в порядке
				и на условиях, предусмотренных Договором;
			</p>
			<p>
				3.1.2. Отказать в заключении Договора на основании настоящей Оферты
				Покупателю в случае его недобросовестного поведения, в частности, в
				случае:
			</p>
			<ul>
				<li>
					более 2 (Двух) отказов от Товаров надлежащего качества в течение года;
				</li>
				<li>предоставления заведомо недостоверной персональной информации;</li>
				<li>
					возврата испорченного Покупателем Товара или Товара, бывшего в
					употреблении;
				</li>
				<li>
					иных случаях недобросовестного поведения, свидетельствующих о
					заключении Покупателем Договора с целью злоупотребления правами, и
					отсутствии обычной экономической цели Договора — приобретения Товара.
				</li>
			</ul>
			<p>
				3.1.3. Продавец обязуется передать Покупателю Товар надлежащего качества
				и в надлежащей упаковке;
			</p>
			<p>3.1.4. Передать Товар свободным от прав третьих лиц;</p>
			<p>3.1.5. Организовать доставку Товаров Покупателю;</p>
			<p>
				3.1.6.Предоставить Покупателю всю необходимую информацию в соответствии
				с требованиями действующего законодательства РФ и настоящей Оферты;
			</p>
			<h4>3.2. Права и обязанности Покупателя:</h4>
			<p>
				3.2.1. Покупатель вправе требовать передачи Товара в порядке и на
				условиях, предусмотренным Договором.
			</p>
			<p>
				3.2.2. Требовать предоставления всей необходимой информации в
				соответствии с требованиями действующего законодательства РФ и настоящей
				Оферты;
			</p>
			<p>
				3.2.3. Отказаться от Товара по основаниям, предусмотренным Договором и
				действующим законодательством Российской Федерации.
			</p>
			<p>
				3.2.4. Покупатель обязуется предоставить Продавцу достоверную
				информацию, необходимую для надлежащего исполнения Договора;
			</p>
			<p>
				3.2.5. Принять и оплатить Товар в соответствии с условиями Договора;
			</p>
			<p>
				3.2.6. Покупатель гарантирует, что все условия Договора ему понятны;
				Покупатель принимает условия без оговорок, а также в полном объеме.
			</p>
			<h3>4. Цена и порядок расчетов</h3>
			<p>
				4.1. Стоимость, а также порядок оплаты Товара определяется на основании
				сведений Продавца при оформлении заявки Покупателем, либо
				устанавливаются на сайте Продавца в сети «Интернет»: https://onegia.ru
			</p>
			<p>4.2. Все расчеты по Договору производятся в безналичном порядке.</p>
			<h3>5. Конфиденциальность и безопасность</h3>
			<p>
				5.1. При реализации настоящего Договора Стороны обеспечивают
				конфиденциальность и безопасность персональных данных в соответствии с
				актуальной редакцией ФЗ от 27.07.2006 г. № 152-ФЗ «О персональных
				данных» и ФЗ от 27.07.2006 г. № 149-ФЗ «Об информации, информационных
				технологиях и о защите информации».
			</p>
			<p>
				5.2. Стороны обязуются сохранять конфиденциальность информации,
				полученной в ходе исполнения настоящего Договора, и принять все
				возможные меры, чтобы предохранить полученную информацию от разглашения.
			</p>
			<p>
				5.3. Под конфиденциальной информацией понимается любая информация,
				передаваемая Продавцом и Покупателем в процессе реализации Договора и
				подлежащая защите, исключения указаны ниже.
			</p>
			<p>
				5.4. Такая информация может содержаться в предоставляемых Продавцом
				локальных нормативных актах, договорах, письмах, отчетах, аналитических
				материалах, результатах исследований, схемах, графиках, спецификациях и
				других документах, оформленных как на бумажных, так и на электронных
				носителях.
			</p>
			<h3>6. Форс-мажор</h3>
			<p>
				6.1. Стороны освобождаются от ответственности за неисполнение или
				ненадлежащее исполнение обязательств по Договору, если надлежащее
				исполнение оказалось невозможным вследствие непреодолимой силы, то есть
				чрезвычайных и непредотвратимых при данных условиях обстоятельств, под
				которыми понимаются: запретные действия властей, эпидемии, блокада,
				эмбарго, землетрясения, наводнения, пожары или другие стихийные
				бедствия.
			</p>
			<p>
				6.2. В случае наступления этих обстоятельств Сторона обязана в течение
				30 (Тридцати) рабочих дней уведомить об этом другую Сторону.
			</p>
			<p>
				6.3. Документ, выданный уполномоченным государственным органом, является
				достаточным подтверждением наличия и продолжительности действия
				непреодолимой силы.
			</p>
			<p>
				6.4. Если обстоятельства непреодолимой силы продолжают действовать более
				60 (Шестидесяти) рабочих дней, то каждая Сторона вправе отказаться от
				настоящего Договора в одностороннем порядке.
			</p>
			<h3>7. Ответственность Сторон</h3>
			<p>
				7.1. В случае неисполнения и/или ненадлежащего исполнения своих
				обязательств по Договору, Стороны несут ответственность в соответствии с
				условиями настоящей Оферты.
			</p>
			<p>
				7.2. Сторона, не исполнившая или ненадлежащим образом исполнившая
				обязательства по Договору, обязана возместить другой Стороне причиненные
				такими нарушениями убытки.
			</p>
			<h3>8. Срок действия настоящей Оферты</h3>
			<p>
				8.1. Оферта вступает в силу с момента размещения на Сайте Продавца и
				действует до момента её отзыва Продавцом.
			</p>
			<p>
				8.2. Продавец оставляет за собой право внести изменения в условия Оферты
				и/или отозвать Оферту в любой момент по своему усмотрению. Сведения об
				изменении или отзыве Оферты доводятся до Покупателя по выбору Продавца
				посредством размещения на сайте Продавца в сети «Интернет», в Личном
				кабинете Покупателя, либо путем направления соответствующего уведомления
				на электронный или почтовый адрес, указанный Покупателем при заключении
				Договора или в ходе его исполнения.
			</p>
			<p>
				8.3. Договор вступает в силу с момента Акцепта условий настоящей Оферты
				Покупателем и действует до полного исполнения Сторонами обязательств по
				Договору.
			</p>
			<p>
				8.4. Изменения, внесенные Продавцом в Договор и опубликованные на сайте
				в форме актуализированной Оферты, считаются принятыми Покупателем в
				полном объеме.
			</p>
			<h3>9. Дополнительные условия</h3>
			<p>
				9.1. Договор, его заключение и исполнение регулируется действующим
				законодательством Российской Федерации. Все вопросы, не урегулированные
				настоящей Офертой или урегулированные не полностью, регулируются в
				соответствии с материальным правом Российской Федерации.
			</p>
			<p>
				9.2. В случае возникновения спора, который может возникнуть между
				Сторонами в ходе исполнения ими своих обязательств по Договору,
				заключенному на условиях настоящей Оферты, Стороны обязаны урегулировать
				спор мирным путем до начала судебного разбирательства.
			</p>
			<p>
				Судебное разбирательство осуществляется в соответствии с
				законодательством Российской Федерации.
			</p>
			<p>
				Споры или разногласия, по которым Стороны не достигли договоренности,
				подлежат разрешению в соответствии с законодательством РФ. Досудебный
				порядок урегулирования спора является обязательным.
			</p>
			<p>
				9.3. В качестве языка Договора, заключаемого на условиях настоящей
				Оферты, а также языка, используемого при любом взаимодействии Сторон
				(включая ведение переписки, предоставление требований / уведомлений /
				разъяснений, предоставление документов и т. д.), Стороны определили
				русский язык.
			</p>
			<p>
				9.4. Все документы, подлежащие предоставлению в соответствии с условиями
				настоящей Оферты, должны быть составлены на русском языке либо иметь
				перевод на русский язык, удостоверенный в установленном порядке.
			</p>
			<p>
				9.5. Бездействие одной из Сторон в случае нарушения условий настоящей
				Оферты не лишает права заинтересованной Стороны осуществлять защиту
				своих интересов позднее, а также не означает отказа от своих прав в
				случае совершения одной из Сторон подобных либо сходных нарушений в
				будущем.
			</p>
			<p>
				9.6. Если на Сайте Продавца в сети «Интернет» есть ссылки на другие
				веб-сайты и материалы третьих лиц, такие ссылки размещены исключительно
				в целях информирования, и Продавец не имеет контроля в отношении
				содержания таких сайтов или материалов. Продавец не несет
				ответственность за любые убытки или ущерб, которые могут возникнуть в
				результате использования таких ссылок.
			</p>
			<h3>10. Реквизиты Продавца</h3>
			<p>
				Полное наименование: Индивидуальный предприниматель Гурова Алена
				Андреевна
			</p>
			<p>ИНН: 100125049861</p>
			<p>ОГРН/ОГРНИП: 322100100006534</p>
			<p>Контактный e-mail: client-service@onegia.ru</p>
			<p>Телефон: +7 921 012-60-04</p>
		</Paper>
	</div>
);
